Revit 2024 API
View.GetTemporaryViewPropertiesName Method
 When Temporary View Properties mode is in progress, name of applied template is returned. Outside Temporary View Properties mode, empty string will be returned.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public string GetTemporaryViewPropertiesName()
Visual Basic
Public Function GetTemporaryViewPropertiesName As String
Visual C++
public:
String^ GetTemporaryViewPropertiesName()
See Also
View Class
Autodesk.Revit.DB Namespace